#include <iostream>
#include <math.h>

using namespace std;

// Вариант 3.12
// 1) Сделать линейную, квадратичную и кубическую аппроксимацию функции методом наименьших квадратов.
// 2) Посчитать среднеквадратичное отклонение и показать, как оно меняется со степенью аппроксимации.

// x: 1.415   1.420   1.425   1.430   1.435   1.440
// y: 8.88551 8.89599 8.90637 8.91667 8.92687 8.93698

int main()
{

    const int size = 6;

    float x[size] = {1.415, 1.420, 1.425, 1.430, 1.435, 1.440};
    float y[size] = {8.88551, 8.89599, 8.90637, 8.91667, 8.92687, 8.93698};

    float xy[2][size] = {{1.415, 1.420, 1.425, 1.430, 1.435, 1.440},
                         {8.88551, 8.89599, 8.90637, 8.91667, 8.92687, 8.93698}};

    for (int i = 0; i < size; i++)
    {
        cout << x[i];
        cout << " ";
    }
    cout << endl;

    for (int i = 0; i < size; i++)
    {
        cout << y[i];
        cout << " ";
    }
    cout << endl;
}